## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/87418714-8614-4927-8af8-179211d1c02f/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_app.app will be destroyed
  # (because azurerm_container_app.app is not in configuration)
  - resource "azurerm_container_app" "app" {
      - container_app_environment_id  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae" -> null
      - custom_domain_verification_id = (sensitive value) -> null
      - id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/containerApps/biotrackr-auth" -> null
      - latest_revision_fqdn          = "biotrackr-auth--tq7equa.gentleforest-e4bb246f.australiaeast.azurecontainerapps.io" -> null
      - latest_revision_name          = "biotrackr-auth--tq7equa" -> null
      - location                      = "australiaeast" -> null
      - name                          = "biotrackr-auth" -> null
      - outbound_ip_addresses         = [
          - "4.237.162.52",
        ] -> null
      - resource_group_name           = "rg-biotrackr-prod-ae" -> null
      - revision_mode                 = "Multiple" -> null
      - tags                          = {
          - "Application" = "biotrackr"
          - "Component"   = "Auth"
          - "environment" = "Production"
          - "owner"       = "willvelida"
        } -> null
        # (1 unchanged attribute hidden)

      - dapr {
          - app_id       = "biotrackr-auth" -> null
          - app_port     = 8080 -> null
          - app_protocol = "http" -> null
        }

      - identity {
          - identity_ids = [
              - "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ] -> null
          - type         = "UserAssigned" -> null
            # (2 unchanged attributes hidden)
        }

      - ingress {
          - allow_insecure_connections = false -> null
          - exposed_port               = 0 -> null
          - external_enabled           = true -> null
          - fqdn                       = "biotrackr-auth.gentleforest-e4bb246f.australiaeast.azurecontainerapps.io" -> null
          - target_port                = 8080 -> null
          - transport                  = "auto" -> null

          - traffic_weight {
              - latest_revision = true -> null
              - percentage      = 100 -> null
                # (2 unchanged attributes hidden)
            }
        }

      - registry {
          - identity             = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae" -> null
          - server               = "acrbiotrackrprodae.azurecr.io" -> null
            # (2 unchanged attributes hidden)
        }

      - template {
          - max_replicas    = 3 -> null
          - min_replicas    = 1 -> null
            # (1 unchanged attribute hidden)

          - container {
              - args              = [] -> null
              - command           = [] -> null
              - cpu               = 0.25 -> null
              - ephemeral_storage = "1Gi" -> null
              - image             = "acrbiotrackrprodae.azurecr.io/biotrackr-auth-api:12946057e58573bd8dc93a02c3970607077d4514" -> null
              - memory            = "0.5Gi" -> null
              - name              = "biotrackr-auth" -> null
            }
        }
    }

  # azurerm_container_app_environment_dapr_component.cron will be destroyed
  # (because azurerm_container_app_environment_dapr_component.cron is not in configuration)
  - resource "azurerm_container_app_environment_dapr_component" "cron" {
      - component_type               = "bindings.cron" -> null
      - container_app_environment_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae" -> null
      - id                           = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae/daprComponents/sayhello" -> null
      - ignore_errors                = false -> null
      - init_timeout                 = "5s" -> null
      - name                         = "sayhello" -> null
      - scopes                       = [
          - "biotrackr-auth",
        ] -> null
      - version                      = "v1" -> null

      - metadata {
          - name        = "schedule" -> null
          - value       = "@every 10m" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_container_app_job.job will be created
  + resource "azurerm_container_app_job" "job" {
      + container_app_environment_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"
      + event_stream_endpoint        = (known after apply)
      + id                           = (known after apply)
      + location                     = "australiaeast"
      + name                         = "biotrackr-auth"
      + outbound_ip_addresses        = (known after apply)
      + replica_retry_limit          = 3
      + replica_timeout_in_seconds   = 60
      + resource_group_name          = "rg-biotrackr-prod-ae"
      + tags                         = {
          + "Application" = "biotrackr"
          + "Component"   = "Auth"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + registries (known after apply)

      + registry {
          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"
          + server   = "acrbiotrackrprodae.azurecr.io"
        }

      + schedule_trigger_config {
          + cron_expression          = "*/15 * * * *"
          + parallelism              = 1
          + replica_completion_count = 1
        }

      + secret (known after apply)

      + secrets (known after apply)

      + template {
          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "acrbiotrackrprodae.azurecr.io/biotrackr-auth:c4c3b930e83d7adff0f5a987882a37225156a483"
              + memory            = "0.5Gi"
              + name              = "biotrackr-auth"
            }
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_container_app.app will be destroyed%0A  # (because azurerm_container_app.app is not in configuration)%0A  - resource "azurerm_container_app" "app" {%0A      - container_app_environment_id  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae" -> null%0A      - custom_domain_verification_id = (sensitive value) -> null%0A      - id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/containerApps/biotrackr-auth" -> null%0A      - latest_revision_fqdn          = "biotrackr-auth--tq7equa.gentleforest-e4bb246f.australiaeast.azurecontainerapps.io" -> null%0A      - latest_revision_name          = "biotrackr-auth--tq7equa" -> null%0A      - location                      = "australiaeast" -> null%0A      - name                          = "biotrackr-auth" -> null%0A      - outbound_ip_addresses         = [%0A          - "4.237.162.52",%0A        ] -> null%0A      - resource_group_name           = "rg-biotrackr-prod-ae" -> null%0A      - revision_mode                 = "Multiple" -> null%0A      - tags                          = {%0A          - "Application" = "biotrackr"%0A          - "Component"   = "Auth"%0A          - "environment" = "Production"%0A          - "owner"       = "willvelida"%0A        } -> null%0A        # (1 unchanged attribute hidden)%0A%0A      - dapr {%0A          - app_id       = "biotrackr-auth" -> null%0A          - app_port     = 8080 -> null%0A          - app_protocol = "http" -> null%0A        }%0A%0A      - identity {%0A          - identity_ids = [%0A              - "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",%0A            ] -> null%0A          - type         = "UserAssigned" -> null%0A            # (2 unchanged attributes hidden)%0A        }%0A%0A      - ingress {%0A          - allow_insecure_connections = false -> null%0A          - exposed_port               = 0 -> null%0A          - external_enabled           = true -> null%0A          - fqdn                       = "biotrackr-auth.gentleforest-e4bb246f.australiaeast.azurecontainerapps.io" -> null%0A          - target_port                = 8080 -> null%0A          - transport                  = "auto" -> null%0A%0A          - traffic_weight {%0A              - latest_revision = true -> null%0A              - percentage      = 100 -> null%0A                # (2 unchanged attributes hidden)%0A            }%0A        }%0A%0A      - registry {%0A          - identity             = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae" -> null%0A          - server               = "acrbiotrackrprodae.azurecr.io" -> null%0A            # (2 unchanged attributes hidden)%0A        }%0A%0A      - template {%0A          - max_replicas    = 3 -> null%0A          - min_replicas    = 1 -> null%0A            # (1 unchanged attribute hidden)%0A%0A          - container {%0A              - args              = [] -> null%0A              - command           = [] -> null%0A              - cpu               = 0.25 -> null%0A              - ephemeral_storage = "1Gi" -> null%0A              - image             = "acrbiotrackrprodae.azurecr.io/biotrackr-auth-api:12946057e58573bd8dc93a02c3970607077d4514" -> null%0A              - memory            = "0.5Gi" -> null%0A              - name              = "biotrackr-auth" -> null%0A            }%0A        }%0A    }%0A%0A  # azurerm_container_app_environment_dapr_component.cron will be destroyed%0A  # (because azurerm_container_app_environment_dapr_component.cron is not in configuration)%0A  - resource "azurerm_container_app_environment_dapr_component" "cron" {%0A      - component_type               = "bindings.cron" -> null%0A      - container_app_environment_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae" -> null%0A      - id                           = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae/daprComponents/sayhello" -> null%0A      - ignore_errors                = false -> null%0A      - init_timeout                 = "5s" -> null%0A      - name                         = "sayhello" -> null%0A      - scopes                       = [%0A          - "biotrackr-auth",%0A        ] -> null%0A      - version                      = "v1" -> null%0A%0A      - metadata {%0A          - name        = "schedule" -> null%0A          - value       = "@every 10m" -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # azurerm_container_app_job.job will be created%0A  + resource "azurerm_container_app_job" "job" {%0A      + container_app_environment_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"%0A      + event_stream_endpoint        = (known after apply)%0A      + id                           = (known after apply)%0A      + location                     = "australiaeast"%0A      + name                         = "biotrackr-auth"%0A      + outbound_ip_addresses        = (known after apply)%0A      + replica_retry_limit          = 3%0A      + replica_timeout_in_seconds   = 60%0A      + resource_group_name          = "rg-biotrackr-prod-ae"%0A      + tags                         = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Auth"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A%0A      + identity {%0A          + identity_ids = [%0A              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",%0A            ]%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A%0A      + registries (known after apply)%0A%0A      + registry {%0A          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"%0A          + server   = "acrbiotrackrprodae.azurecr.io"%0A        }%0A%0A      + schedule_trigger_config {%0A          + cron_expression          = "*/15 * * * *"%0A          + parallelism              = 1%0A          + replica_completion_count = 1%0A        }%0A%0A      + secret (known after apply)%0A%0A      + secrets (known after apply)%0A%0A      + template {%0A          + container {%0A              + cpu               = 0.25%0A              + ephemeral_storage = (known after apply)%0A              + image             = "acrbiotrackrprodae.azurecr.io/biotrackr-auth:c4c3b930e83d7adff0f5a987882a37225156a483"%0A              + memory            = "0.5Gi"%0A              + name              = "biotrackr-auth"%0A            }%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 2 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>